<?php
/*----------------------------------------------------------------------------
 | 2016-10-06 | 經常使用工具 V 0.1
 |
 | Type:
 |   1).文字類 > 以str_為前綴    
 |   
 |   2).數學類 > 以math_為前綴
 |
 | Function List:
 |   1) 文字類:
 |     [1]str_numfit =>用於切割字串,參數分別為( "切割字串" , 長度 , T/F )
 |   
 |   2) 數學類:
 |     [1]math_adv_round => 用於指定小數點後幾位做四捨五入,無條件進位,無條件捨棄
 |                          參數分別為( 要處理之數字 , 方法 , 小數點後幾位 )
 |
 |
 |
 */                         
class Toolbox{
   /*----------------------------------------------------------
    | 文字類別工具
    -----------------------------------------------------------*/ 
    
    // 全形半形轉換
	function nf_to_wf($strs, $types = 'wf_to_nf'){ 
        $nft = array(
            "(", ")", "[", "]", "{", "}", ".", ",", ";", ":",
            "-", "?", "!", "@", "#", "$", "%", "&", "|", "\\",
            "/", "+", "=", "*", "~", "`", "'", "\"", "<", ">",
            "^", "_", "[", "]", "[", "]", "\"","\"","<<",">>",
            "0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
            "a", "b", "c", "d", "e", "f", "g", "h", "i", "j",
            "k", "l", "m", "n", "o", "p", "q", "r", "s", "t",
            "u", "v", "w", "x", "y", "z",
            "A", "B", "C", "D", "E", "F", "G", "H", "I", "J",
            "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T",
            "U", "V", "W", "X", "Y", "Z",
            " "
        );

        $wft = array(
            "（", "）", "〔", "〕", "｛", "｝", "﹒", "，", "；", "：",
            "－", "？", "！", "＠", "＃", "＄", "％", "＆", "｜", "＼",
            "／", "＋", "＝", "＊", "～", "、", "、", "＂", "＜", "＞",
            "︿", "＿", "【", "】", "［", "］","〝","〞","《","》",
            "０", "１", "２", "３", "４", "５", "６", "７", "８", "９",
            "ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ",
            "ｋ", "ｌ", "ｍ", "ｎ", "ｏ", "ｐ", "ｑ", "ｒ", "ｓ", "ｔ",
            "ｕ", "ｖ", "ｗ", "ｘ", "ｙ", "ｚ",
            "Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ",
            "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ", "Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ",
            "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ",
            "　"
        );

        if ( $types == 'nf_to_wf' ){// 轉全形
            return str_replace($nft, $wft, $strs);
        }else if( $types == 'wf_to_nf' ){// 轉半形
            return str_replace($wft, $nft, $strs);
        }else{
            return $strtmp;
        }
    }
    
    // 字串切割(可轉換為半形)
    function str_numfit($_OStr = '',$_LN = 12,$wt = true){
        
        if(is_string($_LN)){
            $_LN = 12;
        }

        if($_OStr !=''){
            if( $wt ){
    	        $_OStr = self :: nf_to_wf( $_OStr );
    	    }
    	    if( mb_strlen($_OStr,"utf-8") > $_LN){

    		     $R_LN = $_LN-3;
    		     return mb_substr( $_OStr ,0,$R_LN,"utf-8")."...";
            
    	    }else{
    		    return $_OStr;
    	    }
        }else{
    	    return "";
        }
    }
 
    /* Math Type */

    /*--------------------------------------------------------------
     | math_adv_round  
     |  
     | 用途(Use for):
     |   當有一串數字,需要做四捨五入,無條件進位或者無條件捨去時
     |
     | 參數(parameters):
     |   1) $num =>要處理數字
     |   
     |   2) $type => 使用哪種進為法,1 > 四捨五入
     |                              2 > 無條件進位
     |                              3 > 無條件捨去
     |
     |
     |   3) $point => 小數點後幾位
     */
    function math_adv_round( $num , $type = 1 , $point=2){
    	$power = 1;

        for($i=0;$i<$point;$i++){
            $power *= 10;
        }

    	switch ($type) {
    		case 2:
    		    $num = ceil($num*$power);
                return $num/$power;
    			break;
    		case 3:
    		    $num = floor($num*$power);
                return $num/$power;
    		    break;
    		default:
    		    $num = round($num*$power);
                return $num/$power;
    			break;
    	}
    	
    }
}
?>